export  const questionsData = [
  {
    questions: [
      {
        question: "Какой формат работы вам больше по душе?",
        options: [
          {
            value: "a",
            text: "Работать над одним проектом, углубляясь в детали.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "b",
            text: "Работать с разными людьми и задачами.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
          {
            value: "c",
            text: "Создавать что-то новое и креативное.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
        ],
      },
      {
        question: "Какой подход вам ближе для начала работы?",
        options: [
          {
            value: "a",
            text: "Сначала продумать детали и стратегию.",
            skills: {
              "Планирование и организация": 50,
            },
          },
          {
            value: "b",
            text: "Начать с простых шагов и постепенно улучшать.",
            skills: {
              "Инициативность и самостоятельность": 50,
            },
          },
          {
            value: "c",
            text: "Сразу пробовать разные идеи и подходы.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
        ],
      },
      {
        question: "Как вы предпочитаете проводить время на работе?",
        options: [
          {
            value: "a",
            text: "Проводить анализ и искать решения.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "b",
            text: "Работать с командой и организовывать задачи.",
            skills: {
              "Планирование и организация": 50,
            },
          },
          {
            value: "c",
            text: "Творить и придумывать новые концепты.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
        ],
      },
      {
        question: "Как вы относитесь к задачам с чёткими требованиями?",
        options: [
          {
            value: "a",
            text: "Люблю, когда задачи детально описаны.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "b",
            text: "Предпочитаю свободу и возможность проявить творчество.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
          {
            value: "c",
            text: "Люблю работать над улучшением существующих процессов.",
            skills: {
              "Планирование и организация": 50,
            },
          },
        ],
      },
      {
        question: "Какой стиль взаимодействия с командой вам подходит?",
        options: [
          {
            value: "a",
            text: "Мне нравится обсуждать идеи и искать лучшие решения с командой.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
          {
            value: "b",
            text: "Я предпочитаю получать чёткие инструкции и работать самостоятельно.",
            skills: {
              "Инициативность и самостоятельность": 50,
            },
          },
          {
            value: "c",
            text: "Сочетаю индивидуальную работу с обсуждением результатов.",
            skills: {
              "Планирование и организация": 50,
            },
          },
        ],
      },
      {
        question: "Что вас мотивирует в работе больше всего?",
        options: [
          {
            value: "a",
            text: "Достижение конкретных результатов и решений.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "b",
            text: "Работа в команде и взаимопомощь.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
          {
            value: "c",
            text: "Творческая свобода и возможность самовыражения.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
        ],
      },
      {
        question: "Как вы относитесь к ошибкам в работе?",
        options: [
          {
            value: "a",
            text: "Ошибки — это возможность научиться и улучшить работу.",
            skills: {
              "Точность и внимательность": 50,
            },
          },
          {
            value: "b",
            text: "Предпочитаю избегать ошибок и следовать строгим стандартам.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "c",
            text: "Ошибки — это часть процесса, я учусь на них и адаптируюсь.",
            skills: {
              "Инициативность и самостоятельность": 50,
            },
          },
        ],
      },
      {
        question: "Как вы предпочитаете справляться с перегрузкой задач?",
        options: [
          {
            value: "a",
            text: "Планирую и разбиваю задачи на более мелкие части.",
            skills: {
              "Планирование и организация": 50,
            },
          },
          {
            value: "b",
            text: "Часто делегирую задачи или прошу помощи.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
          {
            value: "c",
            text: "Пытаюсь выполнить всё сам, даже если это сложно.",
            skills: {
              "Инициативность и самостоятельность": 50,
            },
          },
        ],
      },
      {
        question: "Как вы действуете в незнакомых ситуациях?",
        options: [
          {
            value: "a",
            text: "Исследую информацию, прежде чем принять решение.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "b",
            text: "Пытаюсь применить прошлый опыт для решения проблемы.",
            skills: {
              "Планирование и организация": 50,
            },
          },
          {
            value: "c",
            text: "Ищу креативное решение и быстро действую.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
        ],
      },
      {
        question: "Как вы подходите к обратной связи?",
        options: [
          {
            value: "a",
            text: "Открыт к обратной связи и использую её для улучшения.",
            skills: {
              "Точность и внимательность": 50,
            },
          },
          {
            value: "b",
            text: "Применяю её только в случае необходимости.",
            skills: {
              "Инициативность и самостоятельность": 50,
            },
          },
          {
            value: "c",
            text: "Стараюсь всегда получить мнение других для более точного результата.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
        ],
      },
      {
        question: "Как вы решаете конфликты в команде?",
        options: [
          {
            value: "a",
            text: "Применяю аналитический подход и стараюсь найти логичное решение.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "b",
            text: "Стремлюсь понять точку зрения каждой стороны и найти компромисс.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
          {
            value: "c",
            text: "Предлагаю креативные пути решения, чтобы все стороны были удовлетворены.",
            skills: {
              "Креативность и визуальное мышление": 50,
            },
          },
        ],
      },
      {
        question: "Как вы оцениваете успех в своей работе?",
        options: [
          {
            value: "a",
            text: "Через достигнутые цели и выполнение задач.",
            skills: {
              "Планирование и организация": 50,
            },
          },
          {
            value: "b",
            text: "Через количество сделанных шагов и новаторство.",
            skills: {
              "Инициативность и самостоятельность": 50,
            },
          },
          {
            value: "c",
            text: "Через полученные отзывы и взаимопомощь в команде.",
            skills: {
              "Эмпатия и понимание пользователей": 50,
            },
          },
        ],
      },
      {
        question: "Как вы предпочитаете работать с деталями в проекте?",
        options: [
          {
            value: "a",
            text: "Я обращаю внимание на каждую мелочь, чтобы все было идеально.",
            skills: {
              "Точность и внимательность": 50,
            },
          },
          {
            value: "b",
            text: "Я смотрю на проект в целом, чтобы не упустить главное.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "c",
            text: "Я сосредотачиваюсь на самых важных аспектах, чтобы сэкономить время.",
            skills: {
              "Планирование и организация": 50,
            },
          },
        ],
      },
      {
        question: "Что вы считаете важным при проверке работы других людей?",
        options: [
          {
            value: "a",
            text: "Я тщательно проверяю каждую деталь, чтобы ничего не было упущено.",
            skills: {
              "Точность и внимательность": 50,
            },
          },
          {
            value: "b",
            text: "Я концентрируюсь на общем впечатлении и проверяю основные моменты.",
            skills: {
              "Аналитическое мышление и работа с данными": 50,
            },
          },
          {
            value: "c",
            text: "Я проверяю работу на соответствие заданной цели и ключевым требованиям.",
            skills: {
              "Планирование и организация": 50,
            },
          },
        ],
      },
    ],
  },
];
